

/*
Задача 1
Напишите функцию, которая принимает два числа и возвращает большее значение.
 Вызов функции присвоить переменной и отобразить результат(переменную) в консоле
*/
console.log("Задача 1");

function My(x,y){
	if(x>y){
		return x;
	}else if(x<y){
		return y;
	}
}
	console.log(My(10,6));
console.log("=========================================================");	
	
//Задача 2
/*
Напишите функцию, которая принимает строку и число n, а затем возвращает первые n символов строки. 
Для отображения результа работы функции, вызовите её три раза с различными параметрами, 
результат каждХого вызова присвойте отдельной переменной и выведите переменные в консоль

*/

/*
	//const str = "Hi";
	let str="Hi"
str[0] = 'T'; // ошибка
str[1]='A';

console.log(str);
	
	*/
	
	
console.log("Задача 2");
	
	function My2(str,n)
	{
	return str.substr(0,n);	
	}
		
	let Str="ABBASANDRAQUENSCORPIONS";

     console.log(My2(Str,4));
	 
	 console.log(My2(Str,10));
	 
	 
	 console.log(My2(Str,19));
	 
	 
	 
	 console.log("=========================================================");	
	 
	 
	 /*
	 Задача 3
	 
Напишите функцию, которая принимает массив и элемент, а затем возвращает true, если элемент присутствует в массиве,
 и false в противном случае (если есть повторения заданного элемента в массиве, то на задачу это никак не влияет).
 Результат вызова функции отобразите в консоле

	*/ 

	
console.log("Задача 3");
		
		function My3(Str,s){
			
			return Str.includes(s);
			
		}
		
		
		console.log(My3(Str,"ABBA"));
		
		console.log(My3(Str,"KISS"));
		
		
		
		
		console.log("=========================================================");	
		
	
/*	
		
		Задача4* :
Есть массив чисел - отсортировать его методом пузырька.

*/



console.log("Задача 4");

function SortArr(arr) {
  for (let j = arr.length - 1; j > 0; j--) {
    for (let i = 0; i < j; i++) {
      if (arr[i] > arr[i + 1]) {
        let temp = arr[i];
        arr[i] = arr[i + 1];
        arr[i + 1] = temp;
      }
    }
  }
}


let Arr=[16,123,18,4,9,34,56,8];

console.log(Arr);

SortArr(Arr);

console.log(Arr);
