/*

Задача 1
У вас есть массив чисел [2, 4, 6, 8, 10]. 
Напишите программу для удвоения каждого значения в массиве и вывода результата в консоль.

Задача 2
Есть массив чисел (любых) - поменять первое и последий элемент массива местами

Задача 3
Есть массив чисел (любых) если в массиве есть хотябы одно
 число равное 5 - вывести  в консоль сообщение:
 "5 Найдено" если нет вывести в консоль сообщение "5 Отсутствует"
 
 Задача 4
У вас есть массив чисел [10, 15, 20, 25, 30]. 
Напишите программу для вычисления среднего значения элементов массива
 и вывода результата в консоль.
*/

//Задача 1

console.log("Задача 1");
const Arr=[2,4,6,8,10];
for(let i=0;i<Arr.length;i++){
	Arr[i]=Arr[i]*2;
}

console.log(Arr);


//Задача 2
console.log("Задача 2");
let tmp;
tmp=Arr[0];
let last=Arr.length-1;

Arr[0]=Arr[last];
Arr[last]=tmp;
console.log(Arr);

//Задача 3
console.log("Задача 3");

for(let i=0;i<Arr.length;i++){
	if(Arr[i]==5){
		console.log("5 Найдено");
	}else{
		console.log("5 Отсутствует");
	}
}


//Задача 4
console.log("Задача 4");

const Arr2=[10, 15, 20, 25, 30];

let Sum=0;
let Srednee=0;

for(let i=0;i<Arr2.length;i++){
	Sum=Sum+Arr2[i];
	
}



Srednee=Sum/(Arr2.length);

console.log(Srednee);